greeting = 'Привет, {0}!\nЭтот бот поможет тебе в подготовке' \
           ' к сдаче теоретической части экзамена по вождению.\nНажимай на кнопки ниже.'

category = 'Выбери категорию:'

main_menu = 'Главное меню'

theory_category = ['Правила дорожного движения', 'Дорожные знаки и таблички', 'Дорожная разметка']

test_category = ['📕 Правила дорожного движения', '📗 Дорожные знаки и таблички', '📘 Дорожная разметка']


pdd1 = ['Общие положения', 'Обязательства и права водителей',
        'Движение со спец. сигналами','Обязанности и права пешеходов',
        'Обязанности и права пассажиров', 'Требования к велосипедистам',
        'Требования к управляющим гужевым транспортом', 'Регулирование дорожного движения']

pdd2 = ['Предупреждающие сигналы', 'Начало движения и смена направления',
        'Расположения ТС на дороге', 'Скорость движения',
        'Дистанция, интервал', 'Обгон',
        'Остановка и стоянка', 'Проезд перекрестков']

pdd3 = ['Преимущества маршрутных ТС', 'Проезд пешеходных переходов',
        'Внешние световые приборы', 'Движение через ЖД переезд',
        'Перевозка пасажиров', 'Перевозка груза',
        'Буксировка', 'Учебная езда']

pdd4 = ['Движение в колонах', 'Движение в пешеходной зоне',
        'Движение по автомагистралям и дорогам', 'Движение по спускам и горам',
        'Международное движение', 'Номерные знаки и обозначения',
        'Техническое состояние ТС', 'Вопросы, требующие согласования']


tabl = ['Предупреждающие знаки',
        'Знаки приоритета',
        'Запрещающие знаки',
        'Предписывающие знаки',
        'Информационно-указательные знаки',
        'Знаки сервиса',
        'Таблички к дорожным знакам']

razm = ['Горизонтальная разметка', 'Вертикальная разметка']

back_next = ['⬅️В меню', 'Далее ➡️', '⬅️Назад']

start_test = f'ℹ️ Количество вопросов в тесте - 20.\n' \
    f'⏱ На прохождение теста дается 20 минут\n' \
    f'ℹ️ Cогласно правилам, допускается только две ошибки\n' \
    f'☑ Выбери режим прохождения теста'

test_keyboard = ['По темам', 'Случайные вопросы']

selected_test = 'ℹ️ Вы выбрали {0}\n' \
    f'⏱ Время пойдет после того, как нажмете кнопку "Начать"\n' \
    f'Удачи 😉'

start_close = ['✅ Начать', '❌ Отмена']

start = ['Начать', '❌ Отмена']

'''
😉ℹ️⏱☑️
❌✅
📕📗📘
'''